In [2]:
import sqlite3

In [3]:
db=sqlite3.connect('test.db')

In [15]:
db.execute('DROP TABLE student')
db.execute('CREATE TABLE student(name text, age int, gender text)')
db.commit()

In [16]:
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Ben', '16', 'F'))
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Amy', '17', 'F'))
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Dan', '20', 'F'))
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Andy', '21', 'M'))
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Chris', '18', 'M'))
db.execute('INSERT INTO student(name, age, gender) values(?,?,?)', ('Jenny', '22', 'F'))
db.commit()

In [17]:
lst = db.execute('SELECT * FROM student')
for i in lst:
  print(i)

('Ben', 16, 'F')
('Amy', 17, 'F')
('Dan', 20, 'F')
('Andy', 21, 'M')
('Chris', 18, 'M')
('Jenny', 22, 'F')

In [18]:
lst = db.execute('SELECT * FROM student ORDER by name')
for i in lst:
  print(i)

('Amy', 17, 'F')
('Andy', 21, 'M')
('Ben', 16, 'F')
('Chris', 18, 'M')
('Dan', 20, 'F')
('Jenny', 22, 'F')

In [19]:
lst = db.execute('SELECT * FROM student ORDER by age')
for i in lst:
  print(i)

('Ben', 16, 'F')
('Amy', 17, 'F')
('Chris', 18, 'M')
('Dan', 20, 'F')
('Andy', 21, 'M')
('Jenny', 22, 'F')

In [20]:
db.execute('UPDATE student set gender = ? WHERE name = ?',('M','Ben'))
db.commit()

In [21]:
lst = db.execute('SELECT * FROM student')
for i in lst:
  print(i)

('Ben', 16, 'M')
('Amy', 17, 'F')
('Dan', 20, 'F')
('Andy', 21, 'M')
('Chris', 18, 'M')
('Jenny', 22, 'F')

In [22]:
lst = db.execute('SELECT * FROM student where age >=21')
for i in lst:
  print(i)

('Andy', 21, 'M')
('Jenny', 22, 'F')

In [25]:
db.execute('DELETE FROM student where name = ?',('Amy',))
db.commit()
lst = db.execute('SELECT * FROM student')
for i in lst:
  print(i)

('Ben', 16, 'M')
('Dan', 20, 'F')
('Andy', 21, 'M')
('Chris', 18, 'M')
('Jenny', 22, 'F')

In [27]:
db.execute('DELETE FROM student where age >=21')
db.commit()
lst = db.execute('SELECT * FROM student')
for i in lst:
  print(i)

('Ben', 16, 'M')
('Dan', 20, 'F')
('Chris', 18, 'M')